In [1]:
import numpy as np
import pandas as pd

In [2]:
sr_list = pd.Series(['apple', 'banana', 'grape'])
sr_list

0     apple
1    banana
2     grape
dtype: object

In [3]:
sr_dict = pd.Series({'1': 'apple', '2':'banana', '3':'ChaCha'})
sr_dict

1     apple
2    banana
3    ChaCha
dtype: object

In [4]:
sr_dict.iloc[1:]

2    banana
3    ChaCha
dtype: object

In [5]:
sr_dict.loc["2":]

2    banana
3    ChaCha
dtype: object

In [6]:
dict_data = {
    'c0':[1, 2, 3],
    'c1':10,
    'c2':list('ABC')
}

df = pd.DataFrame(dict_data)
df

   c0  c1 c2
0   1  10  A
1   2  10  B
2   3  10  C

In [7]:
df_1 = pd.DataFrame(dict_data, index= range(1, 4))
df_1

   c0  c1 c2
1   1  10  A
2   2  10  B
3   3  10  C

In [8]:
df_fromt_list = pd.DataFrame(
    [[90, 40, 'man', False],
     [94, 50, 'man', True],
     [60, 50, 'woman', False]],
     columns = ['math', 'english', 'gender', 'pass'],
     index = [1, 2, 3]
)

df_fromt_list

   math  english gender   pass
1    90       40    man  False
2    94       50    man   True
3    60       50  woman  False

In [9]:
df_fromt_list.rename(columns={'math':'science'},
                     index= {1: 'student1'}, inplace=True)
df_fromt_list

          science  english gender   pass
student1       90       40    man  False
2              94       50    man   True
3              60       50  woman  False

In [10]:
saved_df = df_fromt_list.copy()
df_fromt_list.drop(['pass'],axis=1, inplace=True)
df_fromt_list

          science  english gender
student1       90       40    man
2              94       50    man
3              60       50  woman

In [11]:
saved_df

          science  english gender   pass
student1       90       40    man  False
2              94       50    man   True
3              60       50  woman  False

In [14]:
exam_data = {
    '수학': [90, 80, 70],
    '영어': [98, 89, 95],
    '음악': [85, 95, 100],
    '체육':[ 100, 90, 90]
}

student1_pre = pd.Series({'국어':100, '영어':80, '수학':90})
student1_post = pd.Series({'수학':80, '국어':90, '영어':80})
exam_data

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [13]:
addition = student1_pre + student1_post
addition

국어    190
수학    170
영어    160
dtype: int64

In [15]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [16]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']